###################################################################

# Created by write_sdc on Fri Dec 23 16:41:28 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_operating_conditions ff1p16vn40c -library saed32rvt_ff1p16vn40c
set_max_area 0
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[15]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[14]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[13]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[12]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[11]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[10]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[9]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[8]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[7]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[6]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[5]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[4]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[3]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[2]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[1]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {A[0]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[15]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[14]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[13]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[12]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[11]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[10]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[9]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[8]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[7]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[6]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[5]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[4]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[3]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[2]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[1]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {B[0]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[31]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[30]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[29]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[28]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[27]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[26]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[25]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[24]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[23]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[22]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[21]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[20]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[19]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[18]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[17]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[16]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[15]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[14]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[13]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[12]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[11]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[10]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[9]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[8]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[7]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[6]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[5]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[4]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[3]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[2]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[1]}]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ff1p16vn40c -pin Y   \
-no_design_rule [get_ports {C[0]}]
set_load -pin_load 0.569573 [get_ports {Y[31]}]
set_load -pin_load 0.569573 [get_ports {Y[30]}]
set_load -pin_load 0.569573 [get_ports {Y[29]}]
set_load -pin_load 0.569573 [get_ports {Y[28]}]
set_load -pin_load 0.569573 [get_ports {Y[27]}]
set_load -pin_load 0.569573 [get_ports {Y[26]}]
set_load -pin_load 0.569573 [get_ports {Y[25]}]
set_load -pin_load 0.569573 [get_ports {Y[24]}]
set_load -pin_load 0.569573 [get_ports {Y[23]}]
set_load -pin_load 0.569573 [get_ports {Y[22]}]
set_load -pin_load 0.569573 [get_ports {Y[21]}]
set_load -pin_load 0.569573 [get_ports {Y[20]}]
set_load -pin_load 0.569573 [get_ports {Y[19]}]
set_load -pin_load 0.569573 [get_ports {Y[18]}]
set_load -pin_load 0.569573 [get_ports {Y[17]}]
set_load -pin_load 0.569573 [get_ports {Y[16]}]
set_load -pin_load 0.569573 [get_ports {Y[15]}]
set_load -pin_load 0.569573 [get_ports {Y[14]}]
set_load -pin_load 0.569573 [get_ports {Y[13]}]
set_load -pin_load 0.569573 [get_ports {Y[12]}]
set_load -pin_load 0.569573 [get_ports {Y[11]}]
set_load -pin_load 0.569573 [get_ports {Y[10]}]
set_load -pin_load 0.569573 [get_ports {Y[9]}]
set_load -pin_load 0.569573 [get_ports {Y[8]}]
set_load -pin_load 0.569573 [get_ports {Y[7]}]
set_load -pin_load 0.569573 [get_ports {Y[6]}]
set_load -pin_load 0.569573 [get_ports {Y[5]}]
set_load -pin_load 0.569573 [get_ports {Y[4]}]
set_load -pin_load 0.569573 [get_ports {Y[3]}]
set_load -pin_load 0.569573 [get_ports {Y[2]}]
set_load -pin_load 0.569573 [get_ports {Y[1]}]
set_load -pin_load 0.569573 [get_ports {Y[0]}]
create_clock [get_ports CLK]  -name MAIN_CLOCK  -period 5  -waveform {0 2.5}
set_clock_uncertainty 0.5  [get_clocks MAIN_CLOCK]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports RESETn]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports RESETn]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[15]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[15]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[14]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[14]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[13]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[13]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[12]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[12]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[11]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[11]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[10]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[10]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[9]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[9]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[8]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[8]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[7]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[7]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[6]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[6]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[5]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[5]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[4]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[4]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[3]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[3]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[2]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[2]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[1]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[1]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {A[0]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {A[0]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[15]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[15]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[14]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[14]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[13]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[13]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[12]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[12]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[11]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[11]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[10]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[10]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[9]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[9]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[8]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[8]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[7]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[7]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[6]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[6]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[5]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[5]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[4]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[4]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[3]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[3]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[2]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[2]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[1]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[1]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {B[0]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {B[0]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[31]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[31]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[30]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[30]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[29]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[29]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[28]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[28]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[27]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[27]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[26]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[26]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[25]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[25]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[24]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[24]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[23]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[23]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[22]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[22]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[21]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[21]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[20]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[20]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[19]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[19]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[18]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[18]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[17]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[17]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[16]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[16]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[15]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[15]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[14]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[14]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[13]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[13]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[12]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[12]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[11]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[11]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[10]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[10]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[9]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[9]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[8]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[8]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[7]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[7]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[6]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[6]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[5]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[5]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[4]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[4]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[3]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[3]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[2]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[2]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[1]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[1]}]
set_input_delay -clock MAIN_CLOCK  -max 2  [get_ports {C[0]}]
set_input_delay -clock MAIN_CLOCK  -min 0.1  [get_ports {C[0]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[31]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[31]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[30]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[30]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[29]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[29]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[28]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[28]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[27]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[27]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[26]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[26]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[25]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[25]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[24]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[24]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[23]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[23]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[22]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[22]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[21]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[21]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[20]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[20]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[19]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[19]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[18]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[18]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[17]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[17]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[16]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[16]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[15]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[15]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[14]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[14]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[13]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[13]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[12]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[12]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[11]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[11]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[10]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[10]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[9]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[9]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[8]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[8]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[7]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[7]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[6]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[6]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[5]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[5]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[4]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[4]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[3]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[3]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[2]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[2]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[1]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[1]}]
set_output_delay -clock MAIN_CLOCK  -max 2  [get_ports {Y[0]}]
set_output_delay -clock MAIN_CLOCK  -min -0.1  [get_ports {Y[0]}]
